Autodesk.Revit.DB.PanelTypeSet
A set that contains panel types.

Autodesk.Revit.DB.PanelTypeSet.Insert(Autodesk.Revit.DB.PanelType)
System.Int32
Insert the specified panel type into the set.
item: The panel type to be inserted into the set.
Returns: Returns whether the panel type was inserted into the set.

Autodesk.Revit.DB.PanelTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.PanelTypeSet.ReverseIterator
Autodesk.Revit.DB.PanelTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.PanelTypeSet.ForwardIterator
Autodesk.Revit.DB.PanelTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.PanelTypeSet.Erase(Autodesk.Revit.DB.PanelType)
System.Int32
Removes a specified panel type from the set.
item: The panel type to be erased.
Returns: The number of panel types that were erased from the set.

Autodesk.Revit.DB.PanelTypeSet.Contains(Autodesk.Revit.DB.PanelType)
System.Boolean
Tests for the existence of a panel type within the set.
item: The panel type to be searched for.
Returns: The Contains method returns True if the panel type is within the set, otherwise False.

Autodesk.Revit.DB.PanelTypeSet.Clear
void
Removes every panel type from the set, rendering it empty.

Autodesk.Revit.DB.PanelTypeSet.Size
System.Int32
get
Returns the number of panel types that are in the set.

Autodesk.Revit.DB.PanelTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.